Revit 2024 API
BuiltInFailures.GenericMEPFailures.FailedToPlaceCapWarning Property
 Failed to place cap on the open connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailedToPlaceCapWarning { get; }
Visual Basic
Public Shared ReadOnly Property FailedToPlaceCapWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailedToPlaceCapWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace